part of blocks;

var PUZZLES = [
  {
    'name': 'Puzzle #1',
    'data': """
9 3
ĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄ
ĄĀĀĀĀĀĀĀĀĀĀĀĀĀĀĀĀĄ
ĄĀĈĈĈĈĈĈĈĈĈĈĈĈĈĈĀĄ
ĄĀĄĄĄĈĈĈĈĈĈĈĈĄĄĄĀĄ
ĄŰĈĈĈĈĊĈĘĘĈĊĈĈĈĈŠĄ
ĄĀĄĄĄĈĈĈĈĈĈĈĈĄĄĄĀĄ
ĄĀĈĈĈĈĈĈĈĈĈĈĈĈĈĈĀĄ
ĄĀĀĀĀĀĀĀĀĀĀĀĀĀĀĀĀĄ
ĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄĄ
"""
  },
  {
    'name': 'Puzzle #2',
    'data': """
6 4
ĀĀƄƄƄƄƄƄƄƄƄĀ
ĀĀƄĄĄƄƄĄĄĄƄĀ
ĀĀƄĆĆĔĄĄƄĄƄĀ
ĀĀƄĆĆĄĄƄƄĄƄĀ
ĀĀƄƄƄƄĄĄƄĔƄƄ
ĀĀĀƄĄĔĄĄĄĔĄƄ
ĀĀĀƄĄĄĄĄĄĄĄƄ
ĀĀĀƄƄƄƄƄƄƄƄƄ
"""
  },
  {
    'name': 'Puzzle #3',
    'data': """
7 6
ƄƄƄƄƄƄƄƄƄƄƄƄƄƄƄ
ƄĄĄĄĄĄĄĄĄĄĄĄĄĄƄ
ƄĄĄĄĄĄĄĄĄĄĄĄĄĄƄ
ƄĄĄĄĄĄĈĈĈĈĈĄĄĄƄ
ƄĄĔĄąĄĈĊĈĊĈĄĄĄƄ
ƄĄĄĄĄĄĈĈĈĈĈĄĄĄƄ
ƄĄĄĈĈĈĈĈĈĈĈĄĄĄƄ
ƄĄĄĈĈĈĈĈĈĈĈĄĄĄƄ
ƄĄĄĈĈĈĈĈĈĈĈĔĄĄƄ
ƄĄĄĄĄĄĄĔĄĄĄĄĄĄƄ
ƄĄĄĄĄĄĄĄĄĄĄĄĄĄƄ
ƄƄƄƄƄƄƄƄƄƄƄƄƄƄƄ
"""
  }
];
